;********************************************************************
;**                                                                **
;**                  ইংলিশ- বাংলা অনুবাদ                  **
;**                                                                **
;********************************************************************
; *******************************************************************
; *              শব্দ ভাণ্ডার  ()                                      *
; *     (define *পদ * '((ইংরেজি  শব্দ 　"বাংলা অর্থ") ・・・・・・))  *
; *******************************************************************
;=============================== বিশেষ্য  ===============================
(define *n* '(
 (pen "কলম") (time "সময়")(arrow "তীর") (fly "মাছি")(flies "মাছিগুলো")
 (book "বই")(dog "কুকুর")(news "খবর")(capital "রাজধানী")(ring "আংটি")
 (car "গাড়ি")(student "ছাত্র")(teacher "শিক্ষক")(doctor "ডাক্তার")
))
(define *npr* '(                               ; নামবাচক বিশেষ্য 
 (John "জন")(Mary "ম্যারি")(Tokyo "টোকিও ")
))
;=============================== নির্দেশক পদ  ===============================
(define *det* '(
 (a "একটি ")(an "একটি")(the "টি ")
))
;=============================== ক্রিয়া পদ  ===============================
(define *vt*  '(                                          ; সকর্মক ক্রিয়া 
 (like "এর মত")(likes "পছন্দ করে ")(makes "তৈরী")(buys "ক্রয়")(gives "দান")
))
(define *vi*  '(                                          ; অকর্মক ক্রিয়া 
 (fly "উড়ে চলে ")(flies "উড়ে চলে")(runs "দৌড়ে যায়")
))
(define *be*  '(                                          ; সাহায্যকারী ক্রিয়া 
 (is "হয়")(are "হও")(am "হই ")
))
;============================== বিশেষণ পদ  ==============================
(define *a* '(
 (big "বড়")(small "ছোট ") (time "সময়ের")
))
;=============================== বিশেষণের বিশেষণ  ===============================
(define *adv* '(
 (sad "কষ্ট")(wide "বিস্তৃত")(usually "স্বভাবত")
))
;============================== সর্বনাম  ==============================
(define *pron* '(
 (this "এটা ")(that "সেটা ")(it "সেটা ")
 (i "আমি ")(you "তুমি ")(he "সে ")(she "সে")
))
;============================== পদান্বয়ী অব্যয়  ==============================
(define *prep* '(
 (like "এর মত") (on "উপর ")
))
; *****************************************************************
; *                    ব্যাকরণ অভিধান (বাক্য বিন্যাস )                                    *
; * (define *syntax* '(((ইংরেজি বাক্যেবিন্যাস  　বাংলা বাক্যবিন্যাস )) *
; *                                                               *
; *                                                     *
; *   ইংরেজি বাক্য        This     is       a      pen                     *
; *            (*pron*   *be*    *det*    *n*)                    *
; *                  0        1        2       3                      *
; *                                                                *
; *                   (0      1    2       3)                     *
; *                  This    is   a      is                     *
; *                     |      |      |       |                      *
; *  বাংলা বাক্য:   এই  হয় একটি  কলম                     *
; *****************************************************************

(define *syntax* '(
       ((*pron* *be* *det* *n*)      (0 1 2 3))        ; (This is a pen)
       ((*n* *vi* *prep* *det* *n*)  (0 4 2 1))      ; (Time flies like an arrow)
       ((*a* *n* *vt* *det* *n*)     (0 1 3 4 2))   ; (Time flies like an arrow)
))
;********************************************************************
;**                                                                **
;**                  অনুবাদক প্রোগ্রাম                             **
;**                                                                **
;**  [execution কোড ]                                                    **
;**          > (yaku '(ইংলিশ কোড ))                                      **
;**         **
;**                                                                **
;**   [উদাহারণ]                                                     **
;**          > (yaku '(This is a pen))                             **
;**          এই হয় একটি কলম                                 **
;**          #t                                                    **
;**          > (yaku '(Time flies like an arrow))                  **
;**            সময় তীরের মত উড়ে চলে                           **
;**            সময় মাছিগুলো তীর পছন্দ করে                     **
;**          #t                                                    **
;**                                                                **
;********************************************************************
;;
(define (yaku s)  ; বাক্যকে yaku প্রসিডিয়রের আর্গুমেন্ট হিসেবে নিয়ে অনুবাদ 
   (letrec ((syntax *syntax*))  ; বাক্যবিন্যাসগুলো ব্যাকরণ অভিধান(syntax) থেকে  লোকাল ভ্যারিয়েবল (স্থানীয় চলক )*syntax* এ কপিকরণ 
       (do ((k '() k))         ; do লুপ শুরু 
           ((null? syntax) #t) ; সব্গুলো বাক্য খুঁজে দেখা শেষ হলে true রিটার্ন করা হবে 
           (set! k (car syntax))  ; syntax এর মাথা থেকে একটা একটা করে নিয়ে k এর ভিতর ঢোকান হবে 
           (cond ((syntax-match s (car k))  ; বাক্য s কি  k এর সাথে মিলে যাচ্ছে?
                  (translate s (car k)(cadr k))  ;  যদি মিলে যায় তাহলে বাক্য s কে বাক্যবিন্যাস k অনুযায়ী অনুবাদ করা হবে 
                  (newline)))                    ;  নতুন লাইন 
           (set! syntax (cdr syntax)))))         ;  syntax এর মাথা দেখা শেষ হলে সেটার আর প্রয়োজন নেই বলে syntax এর বাকি অংশকে syntax এর মান হিসেবে নির্ধারণ করা হবে ;;
;; (translate '(This is a pen) '(*pron* *be* *det* *n*) '(0 1 2 3 ))
;;       -->
;; এই হয় একটি কলম 
;; #t
;;
(define (translate s ke kj) ; 
   (cond ((null? kj))            ;  
         ((number? (car kj))     ; সংখ্যা কিনা ?
          (display (get-semantics (nth s (car kj)) ; 対応する場所の単語の
                       (eval (nth ke (car kj))))) ; 
          (translate s ke (cdr kj)))         ; 
         (else (display (car kj))   ; 
            (translate s ke (cdr kj)))))     ; 再帰的に次の構文要素を訳す
;;
;; (syntax-match '(this is a pen) '(*pron* *be* *det* *n*))
;;      -->
;; #t
;;
(define (syntax-match s k) ;   বাক্য s এর বাক্যবিন্যাস কি বাক্যবিন্যাস k এর সাথে মিলে ?
   (cond ((null? s) (null? k))  ; সব শব্দ পরীক্ষা করে দেখা হয়েছে কি ?
         ((null? k) #f)         ; প্যাটার্ন ম্যাচিং না হলে false রিটার্ন করবে   
         ((get-semantics (car s) (eval (car k))) ; শুরুর শব্দটা যদি মিলে যায়  
          (syntax-match (cdr s) (cdr k)))        ;   রিকার্সিভ ভাবে বাকি অংশ পরীক্ষা করে দেখবে 
         (else #f)))                                ; না মিললে false রিটার্ন করবে 
;;
;;  (get-semantics 'this *pron*)   -->  "এটা "
;;  (get-semantics 'this *n*)      -->  #f
;;
(define (get-semantics w hinshi)  ; শব্দভাণ্ডার থেকে কোন শব্দের কি অর্থ তা খুঁজে বের করবে get-semantics
 (if  (not(null? hinshi)) 
       (if (equal? (caar hinshi) w) 
          (cadar hinshi)
		(get-semantics w (cdr hinshi))
	)
	#f	
   )
)
;;
;; (nth '(1 2 3 4 5) 4) ==> 5
;;
(define (nth foo baz)  ; লিস্ট foo এর baz+1 নাম্বার এলিমেন্ট (সদস্য )কে রিটার্ণ করার প্রসিডিয়র হল nth 
  (cond ((null? foo) '())
        ((= baz 0) (car foo))
        (else (nth (cdr foo) (- baz 1)))))
